[
  {
    "category": "Diet",
    "data": [
      {
        "Notes": [
          "Try to eat less salty and processed foods like canned soups, deli meats, and chips.",
          "Look at food labels to pick options with less salt.",
          "Eat more fresh fruits and vegetables and cook meals at home.",
          "Keep your daily salt intake below about 1500-2000 mg to help your blood pressure."
        ],
        "title": "Limit Dietary Sodium and Processed Foods",
        "Based": "Based on your blood pressure, sodium levels",
        "Client_Notes": []
      },
      {
        "Notes": [
          "Eat more fruits and vegetables rich in potassium like bananas, spinach, and sweet potatoes.",
          "Try to have 4 to 5 servings of fruits and veggies each day.",
          "Include these foods regularly to help balance your blood pressure.",
          "Don’t skip these healthy foods, and focus on whole foods rather than supplements."
        ],
        "title": "Boost Potassium-Rich Fruits and Vegetables",
        "Based": "Based on your blood pressure, potassium levels",
        "Client_Notes": []
      },
      {
        "Notes": [
          "Add whole grains like oats, brown rice, and quinoa to your meals every day.",
          "Try to eat at least 3 servings of whole grains daily instead of white bread or white rice.",
          "Increase fiber slowly to avoid stomach upset.",
          "Avoid foods made with mostly refined white flour or low fiber."
        ],
        "title": "Increase Whole Grains and Dietary Fiber",
        "Based": "Based on your cholesterol levels, lipid profile",
        "Client_Notes": []
      },
      {
        "Notes": [
          "Use healthier fats like olive oil, nuts, and fatty fish instead of butter or fatty meats.",
          "Eat fatty fish like salmon at least twice each week.",
          "Snack on nuts and cook with olive oil to improve your fat intake.",
          "Avoid butter, fatty meats, and processed baked goods high in saturated fat."
        ],
        "title": "Incorporate Healthy Unsaturated Fats",
        "Based": "Based on your cholesterol levels, inflammatory markers",
        "Client_Notes": []
      }
    ]
  },
  {
    "category": "Lifestyle",
    "data": [
      {
        "Notes": [
          "Practice calming exercises like mindfulness or deep breathing for 10 to 20 minutes each day.",
          "Stick to a daily routine for these relaxation exercises so your body can handle stress better.",
          "Don't skip these practices or do stressful things right before sleep, as it could make your symptoms worse."
        ],
        "title": "Daily Mindfulness and Relaxation Practices",
        "Based": "Based on your stress-related biomarkers or symptom triggers",
        "Client_Notes": []
      },
      {
        "Notes": [
          "Drink water regularly throughout your day, adjusting based on how active you are and your thirst.",
          "Try to choose water instead of caffeinated drinks, especially later in the day, so you stay hydrated and sleep better.",
          "Don't go long times without drinking water, or drink lots of caffeine late.",
          "Don't drink too much water right before bed so you don’t wake up during the night."
        ],
        "title": "Personalized Hydration Routine",
        "Based": "Based on your hydration status",
        "Client_Notes": []
      },
      {
        "Notes": [
          "Make a daily plan with set times to wake up, rest, and do relaxing activities.",
          "Stick to rest times regularly to help reduce stress and keep your symptoms steady.",
          "Don't skip breaks or let your day feel chaotic, as this can make your condition harder to manage."
        ],
        "title": "Structured Daily Routine with Rest Periods",
        "Based": "Based on your symptom control related to routine stability",
        "Client_Notes": []
      }
    ]
  },
  {
    "category": "Activity",
    "data": [
      {
        "Notes": [
          "Do gentle stretching and balance exercises every day to keep your joints flexible and avoid stiffness.",
          "Try activities like yoga, tai chi, or simple balance moves, adjusting them to what feels right for you.",
          "Increase the challenge slowly as you get stronger and more stable.",
          "Don't skip these exercises, because they help prevent falls and keep you moving well.",
          "Don't push yourself too hard too fast or ignore pain during exercises."
        ],
        "title": "Daily Flexibility and Balance Exercises",
        "Based": "Based on your Joint mobility and fall risk indicators",
        "Client_Notes": []
      }
    ]
  },
  {
    "category": "Supplement",
    "data": []
  }
]
